Revit 2025 API
PlasticvinylPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylPattern" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PlasticvinylPatternType
Public Enumeration PlasticvinylPatternType
public enum class PlasticvinylPatternType
type PlasticvinylPatternType
Members
Member name | Value | Description
None | 0
Custom | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace